load-test.yml
config:
  target: "https://securepass.sltdigitallab.lk"
  phases:
    - duration: 60          # total duration: 60 seconds
      arrivalRate: 10       # 10 new users per second
  defaults:
    headers:
      Content-Type: "application/json"

scenarios:
  - name: Signin Test
    flow:
      - post:
          url: "/signin"
          json:
            email: "testuser@example.com"
            password: "password123"